# 2'. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# *Пример:*
# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5])

lists = [2, 3, 4, 5, 6]

lists_new = []

for i in range(len(lists) // 2):
    lists_new.append(lists[i] * lists[-(i + 1)])
if len(lists) % 2 != 0:
    lists_new.append(lists[len(lists) // 2] ** 2)
print(lists_new)
